
▼（単体テスト）インスタンスの生成（異常系は対処していないのでなし）
 【単体テスト1 正常系】productsが期待通りになっている
 【単体テスト2 正常系】greengrocer1が期待通りになっている
 【単体テスト3 正常系】userが期待通りになっている
  
▼（単体テスト）メソッドの動作
#  不要【単体テスト4 異常系】register_productメソッドが期待通り動作しない
 【単体テスト4 正常系】register_productメソッドが期待通り動作する
#  不要【単体テスト5 異常系】disp_productsメソッドが期待通り動作しない
 【単体テスト5 正常系】disp_productsメソッドが期待通り動作する
 【単体テスト6 異常系】choose_productメソッドが期待通り動作しない
 【単体テスト6 正常系】choose_productメソッドが期待通り動作する
#  不要【単体テスト7 異常系】ask_quantityメソッドが期待通り動作しない
 【単体テスト7 正常系】ask_quantityメソッドが期待通り動作する
 【単体テスト8 異常系】decide_quantityメソッドが期待通り動作しない
 【単体テスト8 正常系】decide_quantityメソッドが期待通り動作する
#  不要【単体テスト9 異常系】calculate_chargesメソッドが期待通り動作する
 【単体テスト9 正常系】alculate_chargesメソッドが期待通り動作する

#▼（総合テスト）
